---
kind: property
id: P:Autodesk.Revit.DB.ElementSet.IsEmpty
source: html/06c76247-5873-1f63-af5a-8954059eae22.htm
---
# Autodesk.Revit.DB.ElementSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.